Revit 2027 API
Category.GetLineWeight Method
Retrieves the line weight assigned to the category for the given graphics style type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int? GetLineWeight(
	GraphicsStyleType graphicsStyleType
)
Public Function GetLineWeight (
	graphicsStyleType As GraphicsStyleType
) As Integer?
public:
Nullable<int> GetLineWeight(
	GraphicsStyleType graphicsStyleType
)
member GetLineWeight :
        graphicsStyleType : GraphicsStyleType -> Nullable<int>
Parameters
graphicsStyleType GraphicsStyleType
The type of graphics style.
Return Value
Nullable<Int32>
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the input argument-"graphicsStyleType"-is out of range.
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace